{"pages":[{"title":"About","text":"Soy estudiante de prácticas intermedias de la Facultad de Ingeniería de la Universidad de San Carlos. Desarrollé este blog para orientar a los estudiantes de prácticas iniciales a realizar correctamente sus actividades. BlogEste blog esta basado en Hexo, compilado automáticamente por GitHub Actions. Este tema es llamado Cupertino, Lo puedes conseguir aquí ContactSi quieres contactarme, envíame un email.","link":"/practicas_usac/about/index.html"}],"posts":[{"title":"Instalación de Sistema Operativo Linux","text":"Obtener software para virtualizarPara realizar pruebas o por necesidad, se necesita virtualizar equipos en nuestras computadoras. Para esto, contamos con varios softwares gratuitos para emular nuestros sistemas operativos. Virtual Box VMWare Workstation Player QEMU Obtener Sistema OperativoEl siguiente paso, es seleccionar el sistema operativo a instalar en nuestra máquina virtual o espacio alterno de nuestro equipo y para esto, les mostraré el proceso de instalar la distribución Ubuntu en su versión 20.04 Long Term Support. Ubuntu cuenta con distintos “sabores” para el gusto de todos, las cuales son: Ubuntu Kubuntu Lubuntu Ubuntu Budgie Ubuntu Kylin Ubuntu MATE Ubuntu Studio Xubuntu Ubuntu Cinnamon Instalar Sistema Operativo LinuxLa instalación varía según la distribución que se haya escogido, para las distribuciones derivadas de Debian o Ubuntu se detallará a continuación: En caso de instalar el sistema operativo en un equipo físico, se debe bootear la iso en un dispositivo usb, esto se puede realizar con aplicaciones de booteo como Rufus. Primero se escoge el idioma que se mostrará a lo largo de la instalación. Escogemos nuestra ubicación para establecer el sistema operativo a nuestra región. Escogemos la distribución de nuestro teclado para un mejor acomodo de las teclas. Aquí escogemos realizar una partición manual para tener una instalación personalizada. Este paso lo realizamos solo si la instalación es limpia (si Linux será el único sistema en el disco). Creamos una nueva tabla de partición y tenemos 2 opciones: MBR (Master Boot Record): Es un sistema de particionado en donde solo permite 4 particiones primarias y con un límite de almacenamiento hasta 2 Tb. GPT (Tabla de particiones GUID): Es el nuevo sistema de particionado basado en tablas, este sistema soporta más de 2Tb de almacenamiento y no hay límite en las particiones. Este sistema es el inidicado si se posee sistemas UEFI. Se procede a configurar la partición boot que será indispensable para el arranque del sistema. Se recomienda que esta partición sea en el mismos disco que los sistemas operativos vecinos en caso de tener más de 1 sistema operativo en el disco y que la partición sea de al menos 100Mb. Se crea la partición raiz (/) donde se desglosará los directorios del sistema operativo. Esta partición puede ser de 10Gb Si no se crea la partición home, esta queda dentro de la partición raiz. Esta partición puede ser del tamaño que el usuario decida. Se ingresan las credenciales y nombre del equipo. Comandos LinuxLos comandos Linux para desplazarse y manipular directorios y archivos son los siguientes: 1234567891011121314151617181920212223# cd# Cambia al directorio indicadocd directory# pwd# Muestra el directorio actualpwd# mkdir# Crear un subdirectorio en el directorio actualmkdir directory# touch# Crea un archivo vacio en el directorio actualtouch index.html# Remove# Elimina el subdirectorio indicado. el parámetro -R indica que eliminará toda la rama de directorios hasta el hijorm -R directory/child# nano# Edita el archivo con el editor de texto nanonano file Apache2Instalar Apache2 Para la instalación del servidor Apache2, primero se deben actualizar los repositorio de la distribución Linux para asegurarse de obtener una versión actualizada del software. 1sudo apt update Se procede a instalar el software. Nos pregunta si deseamos instalar el paquete, a lo que respondemos con una s 1sudo apt install apache2 Por último, se actualizan los paquetes. 1sudo apt upgrade Se verifica los servicios de que disponemos. 1sudo ufw app list Mostrar páginaPara mostrar una página en el servidor apache2, nos ubicamos a la ruta /var/www/html, donde html es el directorio de la página e index.html es la página a mostrar. Para cambiar algo de esta página, la podemos editar con cualquier editor del que dispongamos. Para visualizar la página en el servidor, basta con ingresar al localhost. Para editar la página que se muestra por defecto, editamos el archivo index.html 1cd /var/www/html Editamos el archivo con el editor nano, despues de efectuar los cambios, guardamos con ctrl + o y salimos con ctrl + x. Tomar en cuenta que, como el archivo se encuentra dentro de una carpeta restringida, se debe editar con persmisos de super usuario. 1sudo nano index.html Comandos Apache2El software nos da comandos para manipular el servidor apache2: 1234567891011121314# Muestra el estado del servidorsudo systemctl status apache2# Inicia el servidorsudo systemctl start apache2# Recarga cualquier cambio que haya sin reiniciar el servidorsudo systemctl reload apache2# Reinicia el servidorsudo systemctl restart apache2# Detiene el servidorsudo systemctl stop apache2","link":"/practicas_usac/09/02/2021/Instalaci%C3%B3n%20de%20Sistema%20Operativo%20Linux/"},{"title":"Mantenimiento a computadora","text":"Es escencial darle mantenimiento a nuestras computadoras, sean laptop o desktop, ya que por nuestra profesión o por nuestra educación las mantenemos en uso constante y transportada a distintos sitios (en caso de nuestras laptops). Por eso la primera actividad a realizar será explicar la manera ideal de darle un mantenimiento adecuado a nuestra herramienta de estudio y/o trabajo (la computadora). RequisitosAntes de empezar con el mantenimiento, debemos tener a la mano las siguientes herramientas: Desarmador phillips (mediano y pequeño): Por lo general, las laptops vienen ensambladas con tornillos phillips medianos, sin embargo, algunas contienen tornillos pequeños. Contenedor mediano con separadores: Necesitamos un lugar seguro para depositar los tornillos que extraeremos de nuestra laptop, es por eso que necesitamos un contenedor con separadores, este puede ser un pastillero o una caja mediana. Púa de guitarra o cuña plástica: Necesitamos una púa o cuña plástica para levantar la carcasa de la laptop y revisar en su interior. Limpia contactos: Se recomienda limpiar los contactos de la memoria RAM o componentes con puertos PCI. Brocha / Pincel: Para limpiar áreas cubiertas de polvo y gamusa. También se puede hacer uso de un compresor pequeño para limpiar la laptop con aire. Pinzas: También necesitamos hacer uso de pinzas para desconectar las tiras que conectan el teclado, touchpad, discos y ventilador/es de la tarjeta madre. Mantenimiento Si nuestra laptop tuviese una batería extraíble, la retiramos. Ubicamos los tornillos en la parte posterior de nuestra laptop y los retiramos, en ocaciones vienen con tornillos en donde se encontraba la batería que se extrajo. En este paso, ya podemos proceder a retirar el lector de disco (si tuviese uno). En algunos modelos, es necesario retirar tornillos que se encuentran ubicados debajo del teclado, por lo que procedemos a desmontar el teclado, teniendo cuidado de no jalar fuerte, ya que este se encuentra conectado con un cincho a la tarjeta madre. Ubicamos los tornillos ubicados debajo del teclado y retiramos los cinchos del touchpad y pantalla. Procedemos a desmontar la carcasa de nuestra laptop para tener acceso a los componentes internos. Entre los componentes que podemos observar, se encuentran: Disco duro (HDD) / Unidad de estado sólido (SSD) Memoria RAM Ventilador Discipador Desconectamos el ventilador de la tarjeta madre. Procedemos a desmontar el HDD / SDD quitando los tornillos que lo sujetan. Lo pondremos en un lugar seguro teniendo cuidado de no golpearlo. Quitamos los módulos de memoria RAM abriendo los sujetadores. Con los módulos separados, procedemos a limpiar la tarjeta madre con el pincel o compresor para quitarle el polvo de encima, en especial el del ventilador. Limpiamos todos los contactos que estén expuestos. Con todo limpio, procedemos a montar los componentes que extraimos. Devolvemos la carcasa a su lugar y la ajustamos con los tornillos correspondientes. Conectamos todos los cinchos que desconectamos y situamos el teclado en su posición. Y finalmente, colocamos los tornillos de la parte posterior.","link":"/practicas_usac/30/01/2021/Mantenimiento%20a%20computadora/"},{"title":"Taller 1 - Prácticas Iniciales","text":"Entregables del grupo 7 referente al primer taller de prácticas iniciales. Integrantes: Carné Nombre Supervisor de grupo 201020831 Marco Chávez Encargado de grupo 201908169 JOSHUA MUY 201222271 AXEL ESQUIVEL 201700365 SAÚL PÉREZ 201800551 ROGER RIVERA Darle mantenimiento a una computadora no es simplemente de pasarle un “trapo humedo” y quitarle el polvo del exterior, es algo más complejo donde debemos conocer la forma de manipular los componentes internos de nuestro equipo de computo, conocer las precauciones e informarse de los riesgos que conlleva a la mala manipulación.El mantenimiento es algo primordial para la eficiencia, duración y funcionalidad del equipo, por ello es el momento de pasar a los documentos donde se explica y brinda algunos consejos para informar a las personas que hagan este proceso de la manera correcta. El cual fue elaborado para realizar el respectivo mantenimiento de una Laptop. ¡¡Comencemos!! Manual técnico Trifoliar Video del mantenimiento","link":"/practicas_usac/10/02/2021/Taller%201%20-%20Pr%C3%A1cticas%20Iniciales/"}],"tags":[{"name":"linux","slug":"linux","link":"/practicas_usac/tags/linux/"},{"name":"máquina virtual","slug":"maquina-virtual","link":"/practicas_usac/tags/maquina-virtual/"},{"name":"apache2","slug":"apache2","link":"/practicas_usac/tags/apache2/"},{"name":"mantenimiento","slug":"mantenimiento","link":"/practicas_usac/tags/mantenimiento/"},{"name":"limpieza","slug":"limpieza","link":"/practicas_usac/tags/limpieza/"},{"name":"computadora","slug":"computadora","link":"/practicas_usac/tags/computadora/"}],"categories":[]}