{"pages":[{"title":"About","text":"Soy estudiante de prácticas intermedias de la Facultad de Ingeniería de la Universidad de San Carlos. Desarrollé este blog para orientar a los estudiantes de prácticas iniciales a realizar correctamente sus actividades. BlogEste blog esta basado en Hexo, compilado automáticamente por GitHub Actions. Este tema es llamado Cupertino, Lo puedes conseguir aquí ContactSi quieres contactarme, envíame un email.","link":"/practicas_usac/about/index.html"}],"posts":[{"title":"Actividad 1 - Configurar servidor","text":"Universidad de San Carlos de GuatemalaFacultad de IngenieríaPrácticas Iniciales Sección FGrupo 7 Tema: Configuración de servidor web Integrantes: Carné Nombre Supervisor de grupo 201020831 Marco Chávez Encargado de grupo 201908169 JOSHUA MUY 201222271 AXEL ESQUIVEL 201700365 SAÚL PÉREZ 201800551 ROGER RIVERA Manual técnico Video de la configuración","link":"/practicas_usac/17/02/2021/Actividad%201%20-%20Configurar%20servidor/"},{"title":"Comunicación Windows-Linux a través de la red","text":"Para entablar una comunicación Windows - Windows, Windows - Linux o Linux - Linux, lo primero que debemos conocer es la dirección ip de los equipos. Se puede conocer la ip de un equipo por medio de los siguientes comandos. 12# Conocer dirección ip en Windowsipconfig 12# Conocer dirección ip en Linuxifconfig Compartir desde LinuxSambaLo primero que debemos hacer en Linux, es instalar Samba, que es software que nos permitirá compartir directorios y archivos de Linux. Para instalar dicho paquete lo haremos con el siguiente comando. 1sudo apt install samba Teniendo instalado Samba, procedemos a crear el directorio que queremos compartir con los demas sistemas operativos de la red. Compartir directorio Teniendo el directorio creado, accedemos a las propiedades del directorio y nos dirijimos hacia la pestaña Permisos y nos aseguramos de dejar las opciones como se muestra la imagen: Propietario Acceso a carpeta: Crear y eliminar archivos Acceso a archivos: — Grupo Acceso a carpeta: Crear y eliminar archivos Acceso a archivos: — Acceso a carpeta: Crear y eliminar archivos Acceso a archivos: — Luego de habilitar los permisos del directorio, nos trasladamos a la pestaña Compartir y habilitamos Compartir esta carpeta y a continuación se detalla las opciones que se presentan debajo: Permitir a otros crear y eliminar archivos en esta carpeta: Da permiso de modificación dentro de la carpeta a usuarios con acceso a esta. Acceso de invitado: Da acceso a la carpeta a los usuarios invitados, es decir, acceder al directorio sin autenticación. Después de activar ambos opciones, nos dirigimos a Crear compartisión para finalizar el proceso de poner compartido el directorio. Acceder a directorio compartidoPara poder acceder al directorio recién compartido desde otros sistemas operativos en la red local, necesitamos conocer primero la dirección ip del equipo Linux actual, pues la comunicicación entre equipos en la red se da accediendo a ellos por medio de su dirección ipv4. La dirección ipv4 del equipo se encuentra a continucación de inet, en este caso la dirección ipv4 es 192.168.1.17 12# Conocer dirección ipv4ifconfig Antes de acceder desde Windows al directorio compartido, debemos asegurarnos de que el equipo Windows tenga comunicación en la red con el equipo Linux, y para eso, hacemos lo que se llama ping hacia el equipo Linux por medio de su dirección ipv4 obtenida previamente y observar si se reciben los paquetes enviados o se pierden. 1ping 192.168.1.17 Para obtener acceso al directorio compartido desde Windows, debemos abrir el explorador de archivos y escribir en la barra de dirección la ipv4 del equipo Linux de la siguiente manera: \\\\192.168.1.17 En donde encontraremos todas los directorios compartidos en ese equipo. Para comprobar que se accedió de manera exitosa al directorio en Linux, creamos un archivo de texto para después comprobarlo en el equipo Linux. Comprobamos en el equipo Linux que se encuentra el archivo recién creado y dar por hecho la compartición del directorio en Linux. Compartir desde WindowsConfiguración previaAntes de compartir la carpeta, debemos hacer cambios en el acceso al equipo a través de la red local. Empezamos por acceder a la configuración de la red dirigiendonos a Cambiar opciones de uso compartido avanzadas. Después, nos dirigimos al Centro de redes y recursos compartidos y accedemos a Configuración de uso compartido avanzado dejando las opciones como lo indican las imagenes. Esto para permitir el acceso al equipo por usuarios anonimos. Comprobar comunicaciónPara que los equipos de la red local puedan acceder a la carpeta, primero deben poder interactuar con equipo, para comprobarlo debemos conocer la dirección ipv4 de este equipo. 1ipconfig Al momento de hacer ping al equipo Windows, puede que no se reciban los bytes que se envían como es el siguiente caso. Esto puede ser por las directivas del Firewall de Windows, pues, pueda que este desabilitado el envío de bytes en la red (publica, privada o de dominio) en que estemos. Para detener el envío, damos ctrl + c Activar peticionesPara comprobar que esten habilitadas las peticiones en la red que estemos, nos vamos a Configuración de red para luego acceder al Firewall. En esta nueva ventana observamos que estamos en una Red Pública por lo que debemos comprobar si las peticiones en la red pública esté habilitada. Conociendo la red en la que nos encontramos, ingresamos a Configuración avanzada, en la ventana que se muestra nos dirigimos a las Reglas de entrada. y buscamos la regla con el nombre Archivos e impresoras compartidas (petición eco: ICMPv4 de entrada) y observamos que hay 3 reglas con este nombre, ubicamos el perfil con el nombre de la red en la que estemos, este caso es el perfil Público por los que si está deshabilitado lo habilitamos dando clic derecho en la regla y lo habilitamos. Las reglas deben quedar como en la imagen, la regla con el perfil del nombre de nuestra red habilitado. Una vez habilitado las peticiones, regresamos al equipo externo y hacemos ping de nuevo para comprobar que se envíen todos los bytes Compartir carpetaUna vez comprobado que el equipo sea reconocido por los demás equipos, procedemos a crear una carpeta en la ubicación que queramos. Entramos a las propiedades de la carpeta creada y nos ubicamos en la pestaña Compartir, aquí nos dirigimos a la opción Uso compartido avanzado. En esta ventana, nos ubicamos en la opción Permisos para cambiar los permisos de acceso de esta carpeta a los equipos externos. Dejamos las opciones seleccionadas para todos los usuarios tal como está la imagen. Control total: Permitir Cambiar: Permitir Leer: Permitir Si deseamos permitir el acceso solo a determinado grupo o usuario, debemos agregar nombre de grupos o usuario a la lista de arriba y configurandolo de la misma manera, esto para tener un mayor control de quién pueda acceder a esta carpeta. Cabe aclarar que el usuario o grupo debe estar creado en el equipo. Acceder a carpeta compartidaEn el equipo Linux, nos dirigimos a nuestro gestor de ficheros, en este caso es Nemo, y nos ubicamos en la barra de búsqueda e ingresamos a la dirección ipv4 del equipo al que accederemos con el siguiente formato smb://192.168.1.16 Si nos solicita autenticarnos, ingresamos el usuario y contraseña de Windows. Para asegurarnos de que podemos acceder al equipo, creamos un archivo de texto. Para después comprobar que se haya creado desde el equipo Windows.","link":"/practicas_usac/24/02/2021/Comunicaci%C3%B3n%20Windows-Linux%20a%20trav%C3%A9s%20de%20la%20red/"},{"title":"Dual boot Windows y Linux","text":"Sistema operativoPara realizar la práctica, se utilizó la distribución Linux Mint en su versión 19.1 que a su vez es derivada de Ubuntu y esta es basada en Debian. Se optó por utilizar Linux Mint por los bajos recursos que el entorno de escritorio requiere y la facilidad de uso de la distribución, pues, es una interfaz similar al acostrumbrado Windows. La distribución se puede obtener en el sitio oficial Instalar Linux manteniendo WindowsPara hacer esto posible, se optó por una instalación dual boot, es decir, en un mismo disco duro instalar ambos sistemas operativos con las siguientes recomendaciones: Instalar una distribución Linux sobre una instalación Windows, para que dejar el boot de Linux como el predeterminado, ya que Windows no puede leer el boot de Linux, en cambio, Linux si puede leer el de Windows. Reducir el volumen de la partición de Windows, para así, poder instalar la distribución Linux en esta. Instalar distribución linux Para iniciar el boot desde el live CD Linux, se debe presionar la tecla F12 en el momento que está iniciando el arranque el equipo. (En algunos equipos, las teclas pueden variar). Cuando aparezca el menú de selección de arranque, se debe seleccionar el medio por el cual se tiene el live CD (este puede ser una USB o un CD). Primero escogemos el idioma en el que queremos instalar nuestra distribución. Escogemos la distribución de la región en la que queremos tener en nuestro teclado. En este punto, nos da a escoger el tipo de instalación. El instalador nos ofrece las siguientes opciones: Instalar Linux Mint junto a Windows 10: Se puede utilizar esta opción, ya que el mismo instalador se encarga de realizar las particiones necesarias y acomodar las particiones. Borrar disco e instalar Linux Mint: Esta opción, elimina Windows e instala Linux. Esta opción no nos interesa, pues, buscamos mantener ambos Sistemas Operativos. Más opciones: Esta opción nos da la libertad de configurar las particiones como mejor nos convenga. Seleccionamos esta opción pero bien puede ser la primera. Para continuar con la instalación, debemos hacer espacio en la partición para poder instalar Linux. Para esto, debemos entrar a la terminal de la distribución y realizar la partición. 12# Abre el gestor de particiones en el discosudo cfdisk Esto nos despliega las particiones que tiene el disco y nos da la opcion de crear, modificar y eliminar particiones. La opción que queremos es reducir la partición donde se encuentran los datos de Windows. Después de realizar cualquier cambio en la tabla de particiones, se debe guardar para escribir dichos cambios. En este caso, debemos escoger Write. Para confirmar la escritura a los cambios, escribimos yes a la pregunta que nos hacen. Se procede a crear las particiones como es debido para realizar la instalación. Dichas particiones deben quedar de la siguiente manera: Partición Tipo Punto de montaje Tamaño Boot ext4 /boot 100 - 200 Mb Root ext4 / &gt; 10 Gb Home ext4 /home Opcionalmente, el complemento En equipos actuales, ya no es necesario crear una partición swap. Pero si se quisiera, la relación del tamaño queda de la siguiente manera: RAM del equipo Tamaño SWAP &lt; 2GB 2 * RAM del equipo &gt; 4GB RAM del equipo Configuramos nuestras credenciales para la distribución. En este punto, la instalación ha finalizado con éxito. Podemos retirar el CD o USB y reinicar el equipo. Cuando inicia el equipo, veremos el GRUB de Linux preguntandonos por que Sistema Operativo queremos continuar. Un comando que nos será de utilidad, es para obtener la dirección ipv4 y MAC address del equipo. 1234# Obtener dirección en Windowsipconfig# Obtener dirección en Linuxifconfig","link":"/practicas_usac/24/02/2021/Dual%20boot%20Windows%20-%20Linux/"},{"title":"Instalación de Sistema Operativo Linux","text":"Obtener software para virtualizarPara realizar pruebas o por necesidad, se necesita virtualizar equipos en nuestras computadoras. Para esto, contamos con varios softwares gratuitos para emular nuestros sistemas operativos. Virtual Box VMWare Workstation Player QEMU Obtener Sistema OperativoEl siguiente paso, es seleccionar el sistema operativo a instalar en nuestra máquina virtual o espacio alterno de nuestro equipo y para esto, les mostraré el proceso de instalar la distribución Ubuntu en su versión 20.04 Long Term Support. Ubuntu cuenta con distintos “sabores” para el gusto de todos, las cuales son: Ubuntu Kubuntu Lubuntu Ubuntu Budgie Ubuntu Kylin Ubuntu MATE Ubuntu Studio Xubuntu Ubuntu Cinnamon Instalar Sistema Operativo LinuxLa instalación varía según la distribución que se haya escogido, para las distribuciones derivadas de Debian o Ubuntu se detallará a continuación: En caso de instalar el sistema operativo en un equipo físico, se debe bootear la iso en un dispositivo usb, esto se puede realizar con aplicaciones de booteo como Rufus. Primero se escoge el idioma que se mostrará a lo largo de la instalación. Escogemos nuestra ubicación para establecer el sistema operativo a nuestra región. Escogemos la distribución de nuestro teclado para un mejor acomodo de las teclas. Aquí escogemos realizar una partición manual para tener una instalación personalizada. Este paso lo realizamos solo si la instalación es limpia (si Linux será el único sistema en el disco). Creamos una nueva tabla de partición y tenemos 2 opciones: MBR (Master Boot Record): Es un sistema de particionado en donde solo permite 4 particiones primarias y con un límite de almacenamiento hasta 2 Tb. GPT (Tabla de particiones GUID): Es el nuevo sistema de particionado basado en tablas, este sistema soporta más de 2Tb de almacenamiento y no hay límite en las particiones. Este sistema es el inidicado si se posee sistemas UEFI. Se procede a configurar la partición boot que será indispensable para el arranque del sistema. Se recomienda que esta partición sea en el mismos disco que los sistemas operativos vecinos en caso de tener más de 1 sistema operativo en el disco y que la partición sea de al menos 100Mb. Se crea la partición raiz (/) donde se desglosará los directorios del sistema operativo. Esta partición puede ser de 10Gb Si no se crea la partición home, esta queda dentro de la partición raiz. Esta partición puede ser del tamaño que el usuario decida. Se ingresan las credenciales y nombre del equipo. Comandos LinuxLos comandos Linux para desplazarse y manipular directorios y archivos son los siguientes: 1234567891011121314151617181920212223# cd# Cambia al directorio indicadocd directory# pwd# Muestra el directorio actualpwd# mkdir# Crear un subdirectorio en el directorio actualmkdir directory# touch# Crea un archivo vacio en el directorio actualtouch index.html# Remove# Elimina el subdirectorio indicado. el parámetro -R indica que eliminará toda la rama de directorios hasta el hijorm -R directory/child# nano# Edita el archivo con el editor de texto nanonano file Apache2Instalar Apache2 Para la instalación del servidor Apache2, primero se deben actualizar los repositorio de la distribución Linux para asegurarse de obtener una versión actualizada del software. 1sudo apt update Se procede a instalar el software. Nos pregunta si deseamos instalar el paquete, a lo que respondemos con una s 1sudo apt install apache2 Por último, se actualizan los paquetes. 1sudo apt upgrade Se verifica los servicios de que disponemos. 1sudo ufw app list Mostrar páginaPara mostrar una página en el servidor apache2, nos ubicamos a la ruta /var/www/html, donde html es el directorio de la página e index.html es la página a mostrar. Para cambiar algo de esta página, la podemos editar con cualquier editor del que dispongamos. Para visualizar la página en el servidor, basta con ingresar al localhost. Para editar la página que se muestra por defecto, editamos el archivo index.html 1cd /var/www/html Editamos el archivo con el editor nano, despues de efectuar los cambios, guardamos con ctrl + o y salimos con ctrl + x. Tomar en cuenta que, como el archivo se encuentra dentro de una carpeta restringida, se debe editar con persmisos de super usuario. 1sudo nano index.html Comandos Apache2El software nos da comandos para manipular el servidor apache2: 1234567891011121314# Muestra el estado del servidorsudo systemctl status apache2# Inicia el servidorsudo systemctl start apache2# Recarga cualquier cambio que haya sin reiniciar el servidorsudo systemctl reload apache2# Reinicia el servidorsudo systemctl restart apache2# Detiene el servidorsudo systemctl stop apache2","link":"/practicas_usac/09/02/2021/Instalaci%C3%B3n%20de%20Sistema%20Operativo%20Linux/"},{"title":"Mantenimiento a computadora","text":"Es escencial darle mantenimiento a nuestras computadoras, sean laptop o desktop, ya que por nuestra profesión o por nuestra educación las mantenemos en uso constante y transportada a distintos sitios (en caso de nuestras laptops). Por eso la primera actividad a realizar será explicar la manera ideal de darle un mantenimiento adecuado a nuestra herramienta de estudio y/o trabajo (la computadora). RequisitosAntes de empezar con el mantenimiento, debemos tener a la mano las siguientes herramientas: Desarmador phillips (mediano y pequeño): Por lo general, las laptops vienen ensambladas con tornillos phillips medianos, sin embargo, algunas contienen tornillos pequeños. Contenedor mediano con separadores: Necesitamos un lugar seguro para depositar los tornillos que extraeremos de nuestra laptop, es por eso que necesitamos un contenedor con separadores, este puede ser un pastillero o una caja mediana. Púa de guitarra o cuña plástica: Necesitamos una púa o cuña plástica para levantar la carcasa de la laptop y revisar en su interior. Limpia contactos: Se recomienda limpiar los contactos de la memoria RAM o componentes con puertos PCI. Brocha / Pincel: Para limpiar áreas cubiertas de polvo y gamusa. También se puede hacer uso de un compresor pequeño para limpiar la laptop con aire. Pinzas: También necesitamos hacer uso de pinzas para desconectar las tiras que conectan el teclado, touchpad, discos y ventilador/es de la tarjeta madre. Mantenimiento Si nuestra laptop tuviese una batería extraíble, la retiramos. Ubicamos los tornillos en la parte posterior de nuestra laptop y los retiramos, en ocaciones vienen con tornillos en donde se encontraba la batería que se extrajo. En este paso, ya podemos proceder a retirar el lector de disco (si tuviese uno). En algunos modelos, es necesario retirar tornillos que se encuentran ubicados debajo del teclado, por lo que procedemos a desmontar el teclado, teniendo cuidado de no jalar fuerte, ya que este se encuentra conectado con un cincho a la tarjeta madre. Ubicamos los tornillos ubicados debajo del teclado y retiramos los cinchos del touchpad y pantalla. Procedemos a desmontar la carcasa de nuestra laptop para tener acceso a los componentes internos. Entre los componentes que podemos observar, se encuentran: Disco duro (HDD) / Unidad de estado sólido (SSD) Memoria RAM Ventilador Discipador Desconectamos el ventilador de la tarjeta madre. Procedemos a desmontar el HDD / SDD quitando los tornillos que lo sujetan. Lo pondremos en un lugar seguro teniendo cuidado de no golpearlo. Quitamos los módulos de memoria RAM abriendo los sujetadores. Con los módulos separados, procedemos a limpiar la tarjeta madre con el pincel o compresor para quitarle el polvo de encima, en especial el del ventilador. Limpiamos todos los contactos que estén expuestos. Con todo limpio, procedemos a montar los componentes que extraimos. Devolvemos la carcasa a su lugar y la ajustamos con los tornillos correspondientes. Conectamos todos los cinchos que desconectamos y situamos el teclado en su posición. Y finalmente, colocamos los tornillos de la parte posterior.","link":"/practicas_usac/30/01/2021/Mantenimiento%20a%20computadora/"},{"title":"Taller 1 - Prácticas Iniciales","text":"Universidad de San Carlos de GuatemalaFacultad de IngenieríaPrácticas Iniciales Sección FGrupo 7 Tema: Mantenimiento de computadora Integrantes: Carné Nombre Supervisor de grupo 201020831 Marco Chávez Encargado de grupo 201908169 JOSHUA MUY 201222271 AXEL ESQUIVEL 201700365 SAÚL PÉREZ 201800551 ROGER RIVERA Darle mantenimiento a una computadora no es simplemente de pasarle un “trapo humedo” y quitarle el polvo del exterior, es algo más complejo donde debemos conocer la forma de manipular los componentes internos de nuestro equipo de computo, conocer las precauciones e informarse de los riesgos que conlleva a la mala manipulación.El mantenimiento es algo primordial para la eficiencia, duración y funcionalidad del equipo, por ello es el momento de pasar a los documentos donde se explica y brinda algunos consejos para informar a las personas que hagan este proceso de la manera correcta. El cual fue elaborado para realizar el respectivo mantenimiento de una Laptop. ¡¡Comencemos!! Manual técnico Trifoliar Video del mantenimiento","link":"/practicas_usac/10/02/2021/Taller%201%20-%20Pr%C3%A1cticas%20Iniciales/"},{"title":"Tecnologías emergentes 2021","text":"Conferencia: Tecnologías emergentes 2021Fecha: 3 de marzo del 2021 Tendencias de las tecnologías emergentes para el año 2021 según el informe de Gartner. Esto es un documento de Microsoft Office incrustado con tecnología de Office.","link":"/practicas_usac/02/03/2021/Tecnolog%C3%ADas%20emergentes%202021/"}],"tags":[{"name":"Prácticas Iniciales","slug":"Practicas-Iniciales","link":"/practicas_usac/tags/Practicas-Iniciales/"},{"name":"Actividad","slug":"Actividad","link":"/practicas_usac/tags/Actividad/"},{"name":"Red","slug":"Red","link":"/practicas_usac/tags/Red/"},{"name":"Comunicacion linux-windows","slug":"Comunicacion-linux-windows","link":"/practicas_usac/tags/Comunicacion-linux-windows/"},{"name":"Comunicacion windows-linux","slug":"Comunicacion-windows-linux","link":"/practicas_usac/tags/Comunicacion-windows-linux/"},{"name":"Comunicación linux-linux","slug":"Comunicacion-linux-linux","link":"/practicas_usac/tags/Comunicacion-linux-linux/"},{"name":"Dual boot","slug":"Dual-boot","link":"/practicas_usac/tags/Dual-boot/"},{"name":"Linux","slug":"Linux","link":"/practicas_usac/tags/Linux/"},{"name":"Máquina Virtual","slug":"Maquina-Virtual","link":"/practicas_usac/tags/Maquina-Virtual/"},{"name":"Apache2","slug":"Apache2","link":"/practicas_usac/tags/Apache2/"},{"name":"Mantenimiento","slug":"Mantenimiento","link":"/practicas_usac/tags/Mantenimiento/"},{"name":"Limpieza","slug":"Limpieza","link":"/practicas_usac/tags/Limpieza/"},{"name":"Computadora","slug":"Computadora","link":"/practicas_usac/tags/Computadora/"},{"name":"Taller","slug":"Taller","link":"/practicas_usac/tags/Taller/"},{"name":"Tecnologias Emergentes","slug":"Tecnologias-Emergentes","link":"/practicas_usac/tags/Tecnologias-Emergentes/"},{"name":"Prácticas Intermedias","slug":"Practicas-Intermedias","link":"/practicas_usac/tags/Practicas-Intermedias/"}],"categories":[]}